vegeta-cli/src/vegeta/aeromant/templates/hull_rotor_disk/com/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case — values in {{...}} are inserted by aeromant.prepare()
  One propeller as a rotor disk (blade-element source terms): the blade geometry and the section polar
  come from Boreas (radius [m], twist [deg], chord [m]; alpha [deg], Cd, Cl). Thrust is along "axis".
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

diskLeft
{
    type            rotorDisk;
    selectionMode   cellZone;
    cellZone        diskLeft;
    fields          (U);

    nBlades         {{BLADES}};
    tipEffect       {{TIP_EFFECT}};
    inletFlowType   local;
    inletVelocity   ({{INLET_VELOCITY}});
    geometryMode    specified;
    origin          ({{DISK1_CENTER}});
    axis            ({{DISK_AXIS}});
    refDirection    ({{REF_DIRECTION}});
    rpm             {{DISK1_RPM}};
    trimModel       fixed;
    rhoRef          {{DENSITY}};
    rhoInf          {{DENSITY}};

    fixedCoeffs
    {
        theta0      0;
        theta1c     0;
        theta1s     0;
    }
    flapCoeffs
    {
        beta0       0;
        beta1c      0;
        beta2s      0;
    }
    blade
    {
        data
        (
{{BLADE_DATA}}
        );
    }
    profiles
    {
        section
        {
            type    lookup;
            data
            (
{{PROFILE_DATA}}
            );
        }
    }
}

// ************************************************************************* //
